In [3]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [12]:
%sql SELECT * FROM songplays WHERE song_id='SOZCTXZ12AB0182364';

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(483, 1542837407796, 15, 'paid', 'SOZCTXZ12AB0182364', 'AR5KOSW1187FB35FF4', 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"')]

In [9]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(66, 'Kevin', 'Arellano', 'M', 'free'),
 (51, 'Maia', 'Burke', 'F', 'free'),
 (9, 'Wyatt', 'Scott', 'M', 'free'),
 (49, 'Chloe', 'Cuevas', 'F', 'free'),
 (94, 'Noah', 'Chavez', 'M', 'free')]

In [25]:
%sql SELECT * FROM songs where title='Setanta matins';

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('SOZCTXZ12AB0182364', 'Setanta matins', 'AR5KOSW1187FB35FF4', 0, Decimal('269.58322'))]

In [26]:
%sql SELECT * FROM artists where artist_id='AR5KOSW1187FB35FF4';

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('AR5KOSW1187FB35FF4', 'Elena', 'Dubai UAE', Decimal('49.80388'), Decimal('15.47491'))]

In [13]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1542069637796, 0, 13, 46, 11, 2018, 1),
 (1542071549796, 1, 13, 46, 11, 2018, 1),
 (1542079142796, 3, 13, 46, 11, 2018, 1),
 (1542081112796, 3, 13, 46, 11, 2018, 1),
 (1542085206796, 5, 13, 46, 11, 2018, 1)]

In [11]:
%sql SELECT songs.song_id, songs.artist_id FROM songs JOIN artists ON songs.artist_id=artists.artist_id \
WHERE songs.title='Setanta matins' AND artists.name='Elena' AND songs.duration='269.58322'

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('SOZCTXZ12AB0182364', 'AR5KOSW1187FB35FF4')]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).